In [15]:
### Assignment 1: DataFrame Creation and Indexing

#1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the 
# first column.

import pandas as pd
import random

data = {
    "Name":["A","B","C","D","E","F"],
    "Age":[10,20,30,40,50,60],
    "City":["Chennai","Hyderabad","Pune","Bangalore","Mumbai","Delhi"],
    "Married":[True,False,True,False,False,True]
}

df = pd.DataFrame(data,index = data["Name"])
df

  Name  Age       City  Married
A    A   10    Chennai     True
B    B   20  Hyderabad    False
C    C   30       Pune     True
D    D   40  Bangalore    False
E    E   50     Mumbai    False
F    F   60      Delhi     True

In [27]:
## Above was a wrong answer. DF has to have random integers. 
import numpy as np
df = pd.DataFrame(np.random.randint(1,100, size = (6,4)), columns = ["A","B","C","D"])
print("Original_DataFrame: ")
df

Original_DataFrame:

    A   B   C   D
0  77  55  96   5
1  96  58  47  74
2  93  24  30  33
3  84  30  93  72
4   4  68  71  61
5  85   1  60  38

In [39]:
print("New_DataFrame with altered index: ")
df

#df.set_index("A", inplace= True)

New_DataFrame with altered index:

     B   C   D
A
77  55  96   5
96  58  47  74
93  24  30  33
84  30  93  72
4   68  71  61
85   1  60  38

In [44]:
#2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random 
# integers and access the element at row 'Y' and column 'B'.

df1 = pd.DataFrame(np.random.randint(1,10, size =(3,3)), columns = ["A","B","C"], index = ["X","Y","Z"])
print(df1.loc["Y","B"])
df1

2

   A  B  C
X  5  3  2
Y  5  2  6
Z  7  1  7

In [64]:
### Assignment 2: DataFrame Operations

#1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the
# product of the first two columns.

df2 = pd.DataFrame(np.random.randint(1,10,size=(5,3)),columns=["A","B","C"])
df2["D"] = df2["A"]*df2["B"]
df2

   A  B  C   D
0  6  1  2   6
1  3  3  8   9
2  3  4  4  12
3  4  3  5  12
4  1  4  5   4

In [79]:
#2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and 
# column-wise sum.

df3 = pd.DataFrame(np.random.randint(1,10, size=(4,3)), columns= ["A","B","C"])
print(df3)
print("Column-wise sum: ")
print(df3.sum())
print("Row-wise sum: ")
print(df3.sum(axis = 1))

   A  B  C
0  5  8  9
1  7  3  2
2  6  8  7
3  5  2  4
Column-wise sum:
A    23
B    21
C    22
dtype: int64
Row-wise sum:
0    22
1    12
2    21
3    11
dtype: int64

In [114]:
### Assignment 3: Data Cleaning

#1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. 
# Fill the NaN values with the mean of the respective columns.

df1 = pd.DataFrame(np.random.randint(1,11,size=(5,3)), columns=["A","B","C"])
df1.iloc[1:3] = np.nan
print("DataFrame with empty values!")
print(df1)
df1["A"] = df1["A"].fillna(df1["A"].mean())
df1["B"] = df1["B"].fillna(df1["B"].mean())
df1["C"] = df1["C"].fillna(df1["C"].mean())
print("\n DataFrame with corrected values!")
df1

DataFrame with empty values!
     A    B    C
0  9.0  7.0  5.0
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  7.0  4.0  2.0
4  3.0  9.0  1.0

 DataFrame with corrected values!

          A         B         C
0  9.000000  7.000000  5.000000
1  6.333333  6.666667  2.666667
2  6.333333  6.666667  2.666667
3  7.000000  4.000000  2.000000
4  3.000000  9.000000  1.000000

In [159]:
#2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. 
# Drop the rows with any NaN values.

df2 = pd.DataFrame(np.random.randint(1,11,size = (6,4)), columns= ["A","B","C","D"])

df2.iloc[0,3] = np.nan
df2.iloc[2,2] = np.nan
df2.iloc[5,1] = np.nan
print(df2)

"""
dropping_index = df2[df2.isnull().any(axis=1)==True].index
print("\n Final Output Data Frame, post dropping null valued rows:")
df2.drop(dropping_index)

# above is the code in 1st attempt and manual. Below is the simplest code. 
"""
df2.dropna(inplace= True)
print("\n",df2)

   A     B    C    D
0  2  10.0  1.0  NaN
1  2   9.0  6.0  2.0
2  8  10.0  NaN  4.0
3  9   2.0  1.0  5.0
4  3   7.0  4.0  5.0
5  7   NaN  7.0  6.0

    A    B    C    D
1  2  9.0  6.0  2.0
3  9  2.0  1.0  5.0
4  3  7.0  4.0  5.0

In [200]:
### Assignment 4: Data Aggregation

#1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random 
# categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' 
# and compute the sum and mean of 'Value' for each category.

df1 = pd.DataFrame({"Category":np.random.choice(["A","B","C"], size = 10), "Value":np.random.randint(1,100,size=10)})
print(df1)

grouped = df1.groupby("Category")["Value"].agg(["sum","mean"])
print("Grouped Data Frame: ")
grouped

  Category  Value
0        C     48
1        B     16
2        A     41
3        A     98
4        C     30
5        B     57
6        A     84
7        B     19
8        B      1
9        C     16
Grouped Data Frame:

          sum       mean
Category
A         223  74.333333
B          93  23.250000
C          94  31.333333

In [207]:
#2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random 
# data. Group the DataFrame by 'Category' and compute the total sales for each category.

df2 = pd.DataFrame({
    "Product": np.random.choice(["Banana","iPhone16","Sofa"], size = 10),
    "Category": np.random.choice(["Fruits","Electronics","Furniture"], size=10),
    "Sales": np.random.randint(1,100, size = 10)
})

df2 = pd.DataFrame([
    {"Product": "iPhone16", "Category":"Electronics"},
    {"Product": "Banana", "Category":"Fruits"},
    {"Product": "Sofa", "Category":"Furniture"}
])

## Both these options dont work.

In [229]:
df2 = pd.DataFrame({
    "Product":np.random.choice(["Prod1","Prod2","Prod3"], size=10), 
    "Category":np.random.choice(["A","B","C"], size = 10),
    "Sales":np.random.randint(1,100,size=10)
})

print(df2)
grouped_df2 = df2.groupby("Category")["Sales"].sum()
print("Total sales of each Category: ")
grouped_df2

  Product Category  Sales
0   Prod1        B     40
1   Prod2        A     28
2   Prod1        A     68
3   Prod1        A     24
4   Prod2        A     10
5   Prod2        B     56
6   Prod1        B     72
7   Prod2        A     87
8   Prod1        C     90
9   Prod3        B     75
Total sales of each Category:

Category
A    217
B    243
C     90
Name: Sales, dtype: int32

In [214]:
### Assignment 5: Merging DataFrames

#1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.

df3 = pd.DataFrame({
    "Key": ["A","B","C"],
    "Value":["Krishna","Joy","Mallu"],
})

df4 = pd.DataFrame({
    "Key": ["A","B","C"],
    "Value":["Chennai","Bangalore","Mumbai"]
})

pd.merge(df3,df4, on="Key", how="inner")

  Key  Value_x    Value_y
0   A  Krishna    Chennai
1   B      Joy  Bangalore
2   C    Mallu     Mumbai

In [228]:
#2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along
#  the columns.

df1 = pd.DataFrame({"A":np.random.randint(1,100,size=4), "B":np.random.randint(1,100,size=4)})
df2 = pd.DataFrame({"C":np.random.randint(1,100,size=4), "D":np.random.randint(1,100,size=4)})

print(df1)
print("\n")
print(df2)

# Get rows and columns separately and concatenate them: 
row_concat = pd.concat([df1,df2],axis = 0)
print(row_concat)

column_concat = pd.concat([df1,df2],axis = 1)
print(column_concat)

    A   B
0  39  87
1  61  10
2  65  46
3  69  97


    C   D
0  40  90
1  20  41
2  78  97
3  55  19
      A     B     C     D
0  39.0  87.0   NaN   NaN
1  61.0  10.0   NaN   NaN
2  65.0  46.0   NaN   NaN
3  69.0  97.0   NaN   NaN
0   NaN   NaN  40.0  90.0
1   NaN   NaN  20.0  41.0
2   NaN   NaN  78.0  97.0
3   NaN   NaN  55.0  19.0
    A   B   C   D
0  39  87  40  90
1  61  10  20  41
2  65  46  78  97
3  69  97  55  19

In [237]:
### Assignment 9: Applying Functions

#1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that
#  doubles the values of the DataFrame.

df2 = pd.DataFrame(np.random.randint(1,11, size= (5,3)), columns=["A","B","C"])
print(df2)
df2.apply(lambda x:x*2)

# you must use .applymap() since it works element-wise going over to each element and performing the operation
# whereas .apply() method works on a row/column. So here it creates similar results but they operate differently 
# so to avoid unintended errors, if all the elements need to be affected then use .applymap().

# Best exmaple to show the difference between them is when a DF contains strings and you need to calculate
# the length of each strings. You apply .apply() and you will get the length of the row/column and .applymap()
# will give you the length of each individual elements.

   A   B  C
0  2  10  4
1  2   6  5
2  9   6  8
3  1   1  4
4  9   6  6

    A   B   C
0   4  20   8
1   4  12  10
2  18  12  16
3   2   2   8
4  18  12  12

In [3]:
#2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function 
# to create a new column that is the sum of the existing columns.

df3 = pd.DataFrame(np.random.randint(1,11, size = (6,3)), columns=["A","B","C"])
print(df3)
df3["D"] = df3.sum(axis=1)
print("New DataFrame")
print(df3)

    A  B  C
0   9  8  7
1   6  9  4
2   9  3  2
3  10  5  1
4   7  1  4
5   4  6  3
New DataFrame
    A  B  C   D
0   9  8  7  24
1   6  9  4  19
2   9  3  2  14
3  10  5  1  16
4   7  1  4  12
5   4  6  3  13

In [4]:
df3

    A  B  C   D
0   9  8  7  24
1   6  9  4  19
2   9  3  2  14
3  10  5  1  16
4   7  1  4  12
5   4  6  3  13